const carsData = [
  {
    name: "Toyota Highlander Platinum",
    year: 2020,
    mileage: "58 000",
    engine: "2.5 гибрид (6.7 л/100 км)",
    drive: "Полный привод",
    specs: "Подогревы сидений, бесключевой доступ, JBL, камеры 360, панорама, электрорегулировки, слепые зоны",
    price: "4 800 000 ₽",
    phone: "+79494010811",
    img: "car1.jpg",
    country: "🇺🇸 США"
  },
  {
    name: "Nissan Juke",
    year: 2011,
    mileage: "80 000",
    engine: "1.6 (механика)",
    drive: "Передний привод",
    specs: "Климат, мультируль, круиз-контроль, подогревы сидений, режимы езды, сигнализация. Полностью перебрана подвеска и тормозная система.",
    price: "899 000 ₽",
    phone: "+79494010811",
    img: "car2.jpg",
    country: "🇪🇺 Европа"
  },
  {
    name: "Mazda CX-5",
    year: 2018,
    mileage: "117 000",
    engine: "2.5 (автомат)",
    drive: "Передний привод",
    specs: "Кожаный салон, бесключевой доступ, электрорегулировки, подогрев сидений/руля/зеркал, раздельный климат, камера, электробагажник, LED оптика.",
    price: "2 400 000 ₽",
    phone: "+79494010811",
    img: "car3.jpg",
    country: "🇯🇵 Япония"
  },
  {
    name: "BMW X3",
    year: 2023,
    mileage: "43 000",
    engine: "2.0 турбо",
    drive: "Полный привод",
    specs: "Камеры 360, кожа, электрорегулировки, раздельный климат, панорама, лазерная оптика. 1 владелец, документы чистые.",
    price: "5 800 000 ₽",
    phone: "+79494010811",
    img: "car4.jpg",
    country: "🇺🇸 США"
  },
  {
    name: "Chevrolet Trailblazer RS",
    year: 2021,
    mileage: "70 000",
    engine: "1.3 турбо (автомат)",
    drive: "Передний привод",
    specs: "Комплектация RS: спортивные сиденья, LED оптика, мультимедиа, подогревы, камера.",
    price: "1 580 000 ₽",
    phone: "+79494010811",
    img: "car5.jpg",
    country: "🇺🇸 США"
  }
];
